DSCore.List.Contains(System.Collections.IList,System.Object)
Determines if the given list contains the given item. This function searches through the sublists contained in it.
list: List to search in.
item: Item to look for.
Whether list contains the given item.
item,search,in,listcontains

DSCore.List.SetDifference(System.Collections.Generic.IList{System.Object},System.Collections.Generic.IList{System.Object})
Returns a new list that includes objects in List1 but excludes objects in List2.
list1: List of objects to be included in the new list.
list2: List of objects to be excluded in the new list.
The new list that contains objects in List1 but not in List2.
difference,setdifference,set

DSCore.List.SetIntersection(System.Collections.Generic.IList{System.Object},System.Collections.Generic.IList{System.Object})
Returns a new list that includes objects that are present in both List1 and List2.
list1: List of objects to be compared with list2.
list2: List of objects to be compared with list1.
The new list that contains objects that are in both List1 and List2.
intersection,setintersection,set,overlap

DSCore.List.SetUnion(System.Collections.Generic.IList{System.Object},System.Collections.Generic.IList{System.Object})
Returns a new list that includes objects that are present in either List1 or List2.
list1: List of objects to be included.
list2: List of objects to be included to List1.
The new list that contains objects that are either in List1 or List2.
union,setunion,set

DSCore.List.IndexOf(System.Collections.IList,System.Object)
Returns the index of the element in the given list.
list: The list to find the element in.
element: The element whose index is to be returned.
The index of the element in the list.
index,indexof

DSCore.List.Insert(System.Collections.IList,System.Object,System.Int32)
Inserts an element into a list at specified index.
list: The list the element will be inserted to.
element: The element to be inserted.
index: Specifies the location in the list of the element to be inserted.
The list with the element inserted.
insert,add

DSCore.List.Reorder(System.Collections.IList,System.Collections.IList)
Reorders the input list based on the given list of indices.
list: The list to be reordered.
indices: The indices used to reorder the items in the list.
The reordered list.
reorder,index,indices

DSCore.List.SortIndexByValue(System.Collections.Generic.List{System.Double})
Sorts a list by the items and return their indices.
list: The list of items to be sorted.
The indices of the items in the sorted list.
sort,index,value

DSCore.List.AllTrue(System.Collections.IList)
Determines if all items in the given list is a boolean and has a true value.
list: List to be checked on whether all items are true.
Whether all items are true.
test,all,true,istrue

DSCore.List.AllFalse(System.Collections.IList)
Determines if all items in the given list is a boolean and has a false value.
list: List to be checked on whether all items are false.
Whether all items are false.
test,all,false,isfalse

DSCore.List.Flatten(System.Collections.IList,System.Int32)
Flattens a nested list of lists by a certain amount.
list: List to flatten.
amt: Layers of nesting to remove.
flatten,completely