DSCore.String.Split(System.String,System.String[])
Divides a single string into a list of strings, with divisions
determined by the given separator strings.
str: String to split up.
separators:
Strings that, if present, determine the end and start of a split.
List of strings made from the input string.
divide,separator,delimiter,cut,csv,comma,

DSCore.String.Replace(System.String,System.String,System.String)
Replaces all occurrences of text in a string with other text.
str: String to replace substrings in.
searchFor: Text to be replaced.
replaceWith: Text to replace with.
String with replacements made.
replace,overwrite,override,find and replace

DSCore.String.IndexOf(System.String,System.String,System.Boolean)
Finds the zero-based index of the first occurrence of a sub-string inside a string.
Returns -1 if no index could be found.
str: A string to search in.
searchFor: Substring to search for.
ignoreCase: Whether or not comparison takes case into account.
Index of the first occurrence of the substring or -1 if not found.
index of,find substring,where,search

DSCore.String.LastIndexOf(System.String,System.String,System.Boolean)
Finds the zero-based index of the last occurrence of a sub-string inside a string.
Returns -1 if no index could be found.
str: A string to search in.
searchFor: Substring to search for.
ignoreCase: Whether comparison takes case into account.
Index of the last occurrence of the substring or -1 if not found.
last index of,find substring,where,search