DSCore.Color.Components(DSCore.Color)
Lists the components for the color in the order: alpha, red, green, blue.
alpha value
red value
green value
blue value
alpha,red,green,blue

DSCore.Color.Add(DSCore.Color,DSCore.Color)
Construct a Color by combining two input Colors.
Color 11:
Color 22:
Returns:

DSCore.Color.Multiply(DSCore.Color,System.Double)
Multiply an input color with a number multiplier to produce a darker color. Input color must have an alpha less than 255.
Color 11:
multiplier:
Returns:

DSCore.Color.Divide(DSCore.Color,System.Double)
Divide an input color with a number divider to produce a brighter color and remove color tint
Color 11:
divider:
Returns: