DSCore.IO.FileSystem.ReadText(System.IO.FileInfo)
Reads a text file and returns the contents as a string.
Contents of the text file.
read file,text,file

DSCore.IO.FileSystem.MoveFile(System.String,System.String,System.Boolean)
Moves a specified file to a new location
path:
newPath:
overwrite:

DSCore.IO.FileSystem.DeleteFile(System.String)
Deletes the specified file.
path:

DSCore.IO.FileSystem.CopyFile(System.IO.FileInfo,System.String,System.Boolean)
Copies a file.
file:
destinationPath:
overwrite:

DSCore.IO.FileSystem.FileExists(System.String)
Determines if a file exists at the given path.
path:
filepath

DSCore.IO.FileSystem.WriteText(System.String,System.String)
Write the text content to a file specified by the path
filePath: Path to write to
text: Text content
write file,text,file,filepath

DSCore.IO.FileSystem.AppendText(System.String,System.String)
Append the text content to a file specified by the path
filePath: Path to write to
text: Text content
append file,write file,text,file,filepath

DSCore.IO.FileSystem.CombinePath(System.String[])
Combines multiple strings into a single file path.
paths: String to combine into a path.

DSCore.IO.FileSystem.FileExtension(System.String)
Returns the extension from a file path.
path: Path to get extension of.

DSCore.IO.FileSystem.ChangePathExtension(System.String,System.String)
Changes the extension of a file path.
path: Path to change extension of.
newExtension: New extension.

DSCore.IO.FileSystem.DirectoryName(System.String)
Returns the directory name of a file path.
path: Path to get directory information of.
directorypath

DSCore.IO.FileSystem.FileName(System.String,System.Boolean)
Returns the file name of a file path.
path: Path to get the file name of.
withExtension: Determines whether or not the extension is included in the result, defaults to true.

DSCore.IO.FileSystem.FileHasExtension(System.String)
Determines whether or not a file path contains an extension.
path: Path to check for an extension.

DSCore.IO.FileSystem.CopyDirectory(System.IO.DirectoryInfo,System.String,System.Boolean)
Copies a directory to a destination location.
directory: Directory to copy.
destinationPath: Destination of the copy operation on disk.
overwriteFiles:

DSCore.IO.FileSystem.DeleteDirectory(System.String,System.Boolean)
Deletes a directory.
path: Path to a directory on disk.
recursive: Whether or not to delete all contents of the directory, defaults to false.

DSCore.IO.FileSystem.DirectoryExists(System.String)
Determines if a directory exists at the given path.
path: Path to a directory on disk.
directorypath

DSCore.IO.FileSystem.MoveDirectory(System.String,System.String,System.Boolean)
Moves a directory to a new location.
path:
newPath:
overwriteFiles: