DSCore.Math.EvaluateFormula(System.String,System.String[],System.Object[])
Evaluates an NCalc formula with given parameter mappings.
formulaString: NCalc formula
parameters: Variable names
args: Variable bindings
Result of the formula calculation.

DSCore.Math.Xor(System.Boolean,System.Boolean)
Boolean XOR: Returns true if and only if exactly one of the inputs is true.
a: A boolean.
b: A boolean.
Boolean result.
xor,exclusive,or